> chunked_array(c(1, 2, 3), c(4, 5, 6))
ChunkedArray
[
  [
    1,
    2,
    3
  ],
  [
    4,
    5,
    6
  ]
]

> chunked_array(1:30, c(4, 5, 6))
ChunkedArray
[
  [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    ...
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30
  ],
  [
    4,
    5,
    6
  ]
]

> chunked_array(1:30)
ChunkedArray
[
  [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    ...
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30
  ]
]

> chunked_array(factor(c("a", "b")), factor(c("c", "d")))
ChunkedArray
[

  -- dictionary:
    [
      "a",
      "b"
    ]
  -- indices:
    [
      0,
      1
    ],

  -- dictionary:
    [
      "c",
      "d"
    ]
  -- indices:
    [
      0,
      1
    ]
]

